Documents/РасходПоЗадачеПроизводство.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Document>
		<Properties>
			<Name>РасходПоЗадачеПроизводство</Name>
			<BasedOn>
				<xr:Item>Catalog.ЗадачиПроектов</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.БюджетПоМесяцам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЗадачаПроекта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗадачиПроектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсполнительДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяСметы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиСметы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Описание</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтатьяРасходов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Название</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РКО</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаКонвертации</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/РасходПоЗадачеПроизводство/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервереБезКонтекста
Функция  ПолучитьПроцентРКО( ЗадачаПроекта   )
	// из регистра	
	РКО = ПлановыйПоказательСметы( ЗадачаПроекта.Владелец.ГодПроекта , "СтавкаРКО" );
	Возврат РКО /100;
КонецФункции



&НаКлиенте
Процедура ОписаниеПриИзменении(Элемент)
	Стр = Элементы.Описание.ТекущиеДанные;
	Если Стр.РКО Тогда
		ПроцентРКО = ПолучитьПроцентРКО( Объект.ЗадачаПроекта );
		Стр.СуммаКонвертации	= Стр.Сумма *  ПроцентРКО;
	Иначе
		Стр.СуммаКонвертации	= 0;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ИтогоПоДокументу()
	ВсегоРасход = Объект.Описание.Итог("Сумма") + Объект.Описание.Итог("СуммаКонвертации");
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ИтогоПоДокументу()
КонецПроцедуры


#Область ЗаполнениеИзКалькулятора

&НаКлиенте
Процедура ЗаполнитьИзКалькулятора(Команда)
	Перем КалькуляторР;
	Если Объект.Проведен Тогда
		ПоказатьПредупреждение(,"Заполнить из калькулятора можно только непроведенный расход по задаче!");
		Возврат;
	КонецЕсли;
	
	ОпОповещения = Новый ОписаниеОповещения("ПодтвердитьЗаполнение", ЭтаФорма );
	ПоказатьВводЗначения( ОпОповещения, КалькуляторР,, Тип("СправочникСсылка.КалькуляторРасходаПоЗадаче"));
КонецПроцедуры

&НаКлиенте
Процедура ПодтвердитьЗаполнение(КалькуляторР, ДопПараметры ) Экспорт
	Если КалькуляторР = Неопределено Тогда Возврат; КонецЕсли;
	
	ОпОповещения = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтаФорма, КалькуляторР  );
	ПоказатьВопрос(ОпОповещения, "Заполнить текущий расход по задаче из выбранного калькулятора?",
						РежимДиалогаВопрос.ДаНет);
		
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, КалькуляторР ) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗаполнитьИзКалькулятораНаСервере( КалькуляторР );
		ИтогоПоДокументу();
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИзКалькулятораНаСервере( КалькуляторР )
	// ничего не проверяем проверяем 
	Док = РеквизитФормыВЗначение("Объект");
	ЗаполнитьЗначенияСвойств( Док, КалькуляторР );
	Описание  = КалькуляторР.Описание.Выгрузить();
	Док.Описание.Загрузить( Описание );
	
	ЗначениеВРеквизитФормы( Док, "Объект");
	
	ЭтаФорма.Модифицированность = Истина;
КонецПроцедуры


#КонецОбласти
